"""
Indicator metadata for downloader.py
"""

region_codes = [
    '01', '03', '04', '05', '07', '08', '10', '11', '12', '14', '15',
    '17', '18', '19', '20', '22', '24', '25', '26', '27', '28', '29', '30',
    '32', '33', '34', '35', '36', '37', '38', '40', '41', '42', '44', '45',
    '46', '47', '49', '50', '52', '53', '54', '56', '57', '58', '60',
    '61', '63', '64', '65', '66', '67', '68', '69', '70', '71', '73', '75',
    '76', '77', '78', '79', '80', '81', '82', '83', '84', '85',
    '86', '87', '88', '89', '90', '91', '92', '93', '94', '95',
    '96', '97', '98', '99'
]

templates = {

    # = = = = = =
    # Территория
    # = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Общая протяженность улиц, проездов, набережных на конец года
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "street_network": {
        "num": 1,
        "id": "p8006007",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "34": {"god": "2009"},
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "75": {"god": "2016"},
        "96": {"god": "2015"}
    },

    # = = = = = =
    # Население
    # = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Общий коэффициент естественного прироста (убыли)
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "nat_ch_perc": {
        "num": 2,
        "id": "p8112009",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2016",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "01": {"god": "2014"},
        "03": {"god": "2013"},
        "05": {"god": "2012"},
        "08": {"god": "2013"},
        "17": {"god": "2013"},
        "18": {"god": "2012"},
        "20": {"god": "2013"},
        "24": {"god": "2013"},
        "25": {"god": "2014"},
        "26": {"god": "2013"},
        "28": {"god": "2014"},
        "30": {"god": "2012"},
        "33": {"god": "2013"},
        "36": {"god": "2013"},
        "38": {"god": "2013"},
        "40": {"god": "2015"},
        "42": {"god": "2012"},
        "44": {"available": "no"},
        "45": {"god": "2012"},
        "46": {"god": "2013"},
        "52": {"god": "2019"},
        "57": {"god": "2008"},
        "58": {"god": "2012"},
        "60": {"god": "2012"},
        "61": {"god": "2013"},
        "64": {"god": "2012"},
        "65": {"god": "2012"},
        "67": {"god": "2018"},
        "68": {"god": "2012"},
        "71": {"god": "2013"},
        "73": {"god": "2012"},
        "76": {"god": "2013"},
        "78": {"god": "2012"},
        "79": {"god": "2012"},
        "80": {"god": "2012"},
        "81": {"god": "2014"},
        "82": {"god": "2014"},
        "84": {"god": "2019"},
        "85": {"god": "2014"},
        "86": {"god": "2014"},
        "87": {"god": "2013"},
        "88": {"god": "2013"},
        "89": {"god": "2013"},
        "92": {"god": "2012"},
        "93": {"god": "2011"},
        "94": {"god": "2014"},
        "98": {"god": "2013"},
        "99": {"god": "2013"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Естественный прирост (убыль)
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "nat_ch_total": {
        "num": 3,
        "id": "p8112004",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2012",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "01": {"god": "2014"},
        "20": {"god": "2013"},
        "25": {"god": "2014"},
        "26": {"god": "2011"},
        "33": {"god": "2016"},
        "34": {"god": "2016"},
        "35": {"god": "2016"},
        "37": {"god": "2016"},
        "40": {"god": "2015"},
        "41": {"god": "2016"},
        "54": {"god": "2016"},
        "63": {"god": "2016"},
        "66": {"god": "2011"},
        "67": {"god": "2017"},
        "73": {"god": "2015"},
        "81": {"god": "2013"},
        "84": {"god": "2011"},
        "85": {"god": "2014"},
        "86": {"god": "2011"},
        "90": {"god": "2016"},
        "93": {"god": "2011"},
        "95": {"god": "2016"},
        "96": {"god": "2015"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Численность всего населения по полу и возрасту на 1 января
    # текущего года
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "gender_age_gr": {
        "num": 4,
        "id": "p8112014",
        "default" :{
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2011",
            "period": ["на 1 января", "на 1 января (с 2018 г.)", 
                       "на 1 января года", 
                       "на 1 января года следующего за отчетным",
                       "На 1 января"],
            "vozr": "*",
            "grup_2": "*"
        },
        "03": {"god": "2012"},
        "08": {"god": "2011"},
        "11": {"god": "2012"},
        "14": {"god": "2012"},
        "22": {"god": "2012"},
        "33": {"god": "2012"},
        "35": {"god": "2016"},
        "36": {"god": "2012"},
        "38": {"god": "2012"},
        "40": {"available": "no"},
        "41": {"god": "2014"},
        "45": {"available": "no"},
        "46": {"god": "2012"},
        "57": {"god": "2012"},
        "61": {"god": "2012"},
        "65": {"god": "2012"},
        "67": {"available": "no"},
        "73": {"god": "2013"},
        "75": {"god": "2012"},
        "80": {"god": "2012"},
        "82": {"god": "2012"},
        "96": {"god": "2013"},
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Миграционный прирост
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "migration": {
        "num": 5,
        "id": "p8112023",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2011",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            "vozr": ["Всего", "ВСЕГО"],
            "grup_2": "Всего",
            "migr": ["Миграция-всего", "Миграция - всего", "миграция-всего",
                     "Миграция  - всего", "Миграция- всего", "Миграция, всего",
                     "Миграция - Всего"]
            },
        "03": {"god": "2014"},
        "04": {"god": "2012"},
        "08": {"god": "2014"},
        "15": {"god": "2014"},
        "24": {"god": "2012"},
        "26": {"god": "2014"},
        "35": {"god": "2015"},
        "38": {"god": "2017"},
        "40": {"god": "2017"},
        "49": {"god": "2012"},
        "53": {"god": "2014"},
        "54": {"god": "2015"},
        "58": {"god": "2013"},
        "67": {"available": "no"},
        "71": {"god": "2014"},
        "76": {"god": "2012"},
        "77": {"god": "2015"},
        "82": {"god": "2015"},
        "83": {"god": "2015"},
        "84": {"god": "2012"},
        "85": {"god": "2014"},
        "88": {"god": "2012"},
        "89": {"god": "2012"},
        "93": {"god": "2014"},
        "94": {"god": "2016"},
        "96": {"god": "2015"},
        "97": {"god": "2012"},
        "98": {"god": "2012"}
        
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Национальный состав населения
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "ethnicity": {
        "num": 6,
        "id": "p8112035",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "nazsostv": "*",
            "period": ["на 14 октября 2010 г.", "на 14 октября 2010 года",
                       "на 14 октября 2010г.", "значение показателя за год",
                       "на 14 октября", "на 14 октября 2010",
                       "На 14 октября 2010 года", "1 раз в 10 лет",
                       "на 10 октября 2010", "на  14 октября 2010 года",
                       "на  14 октября 2010 г."]
            },
        "11": {"available": "no"},
        "19": {"available": "no"},
        "26": {"available": "no"},
        "33": {"available": "no"},
        "35": {"available": "no"},
        "40": {"available": "no"},
        "41": {"available": "no"},
        "45": {"available": "no"},
        "46": {"god": "2012"},
        "56": {"available": "no"},
        "63": {"available": "no"},
        "67": {"available": "no"},
        "69": {"available": "no"},
        "77": {"available": "no"},
        "78": {"available": "no"},
        "84": {"available": "no"},
        "91": {"available": "no"},
        "92": {"god": "2012"},
        "98": {"available": "no"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Средний размер частного домохозяйства
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "households": {
        "num": 7,
        "id": "p8112030",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["на 14 октября 2010 г.", "на 14 октября 2010 года",
                       "на 14 октября 2010г.", "значение показателя за год",
                       "на 14 октября", "на 14 октября 2010",
                       "На 14 октября 2010 года", "1 раз в 10 лет",
                       "на 10 октября 2010", "на  14 октября 2010 года",
                       "на  14 октября 2010 г.", "на 14 октября 2010 г"]
            },
        "11": {"available": "no"},
        "19": {"available": "no"},
        "26": {"available": "no"},
        "33": {"available": "no"},
        "34": {"available": "temp"},
        "35": {"available": "no"},
        "45": {"available": "no"},
        "46": {"god": "2012"},
        "56": {"available": "no"},
        "67": {"available": "no"},
        "77": {"available": "no"},
        "78": {"available": "no"},
        "84": {"available": "no"},
        "91": {"available": "no"},
        "92": {"god": "2012"},
        "98": {"available": "no"}
    },

    # = = = = = = = = = = = = = = =
    # Занятость и заработная плата
    # = = = = = = = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Среднемесячная заработная плата работников организаций
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "wages_by_occ": {
        "num": 8,
        "id": "p8123007",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "okved": "*",
            "period": ["январь-декабрь", "за январь-декабрь", "Январь-декабрь"]
            },
        "08": {"god": "2011"},
        "35": {"god": "2016"},
        "67": {"available": "no"},
        "76": {"period": "IV квартал"},
        "77": {"god": "2009"},
        "89": {"available": "no"},
        "96": {"god": "2013"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Среднесписочная численность работников организаций (по 2016 год)
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "workers_by_occ": {
        "num": 9,
        "id": "p8123005",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "okved": "*",
            "period": ["январь-декабрь", "за январь-декабрь", "Январь-декабрь"]
            },
        "08": {"god": "2011"},
        "35": {"god": "2016"},
        "67": {"available": "no"},
        "76": {"period": "IV квартал"},
        "77": {"god": "2009"},
        "89": {"available": "no"},
        "96": {"god": "2013"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Среднемесячная начисленная заработная плата в среднем на 1
    # работника органов местного самоуправления (без выплат социального
    # характера)
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "wages_govt": {
        "num": 10,
        "id": "p8123010",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "okogu": [("Местные администрации (исполнительно-распорядительные "
                      "органы муниципальных образований) - всего"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований)-всего"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований) - всего."),
                      ("Местные администрации (исполнительно - распорядительные "
                       "органы муниципальных образований) - всего"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований) - всего*"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований)"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований)  - всего"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований) - всего (до 2011 года)"),
                      ("_Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований) - всего"),
                      ("Местные администрации (исполнительно- рапорядительные "
                       "органы муниципальных образований) - всего"),
                      ("Местные администрации   (исполнительно-распорядительные "
                       "органы мниципальных образований) - всего."),
                      ("Местные администрации   (исполнительно-распорядительные "
                       "органы мниципальных образований) - всего (сумма кодов "
                       "ОКОГУ 3300100, 3300..."),
                      ("Местные администрации   (исполнительно-распорядительные "
                       "органы мниципальных образований) - всего"),
                      ("Местные администрации (исполнительно - распорядительные  "
                       "органы муниципальных образований) - всего"),
                      ("Местные администрации (исполнительно-распорядительные "
                       "органы муниципальных образований) - всего2")],
            "wetwl": ["всего", "Всего", 
                      "Всего (Данные выгружаются по строке всего)",
                      "всего (Данные выгружаются по строке всего)",
                      "региональный уровень"],
            "period": ["январь-декабрь", "значение показателя за год",
                       "за январь-декабрь", "Январь-декабрь"]
            },
        "04": {"god": "2011"},
        "05": {"god": "2012"},
        "08": {"god": "2011"},
        "15": {"god": "2011"},
        "17": {"period": "январь-сентябрь"},
        "19": {"period": "январь-сентябрь"},
        "24": {"okogu": ("Местные администрации (исполнительно-распорядительные"
                         " органы муниципальных образований) - всего (сумма "
                         "кодов ОКОГУ 3300100,330020..."),
               "period": "январь-сентябрь",
               "god": "2014"},
        "26": {"god": "2012",
               "period": "январь-март"},
        "29": {"wetwl": ["сельский уровень", "районный, городской уровни"]},
        "32": {"god": "2011"},
        "35": {"god": "2018"},
        "37": {"god": "2011"},
        "42": {"god": "2012"},
        "45": {"god": "2012"},
        "47": {"god": "2012"},
        "53": {"okogu": ("Местные администрации (исполнительно-распорядительные"
                         " органы муниципальных образований) - всего."),
               "god": "2014",
               "period": "январь-сентябрь"},
        "57": {"okogu": ("Местные администрации (исполнительно-распорядительные"
                         " органы муниципальных образований) - всего. (3300000="
                         "сумма строк с кодами ОК..."),
               "god": "2012",
               "period": "январь-декабрь"},
        "60": {"god": "2012"},
        "67": {"god": "2017"},
        "68": {"period": "январь-март"},
        "75": {"god": "2012", "period": "январь-сентябрь"},
        "76": {"god": "2012"},
        "77": {"god": "2009"},
        "79": {"god": "2012"},
        "81": {"god": "2017"},
        "82": {"god": "2017",
               "okogu": ("Местные администрации (исполнительно-распорядительные"
                         " органы муниципальных образований) - всего"),
               "period": "значение за год"},
        "84": {"god": "2012"},
        "85": {"god": "2013"},
        "89": {"god": "2012"},
        "93": {"god": "2011"},
        "94": {"god": "2011"},
        "95": {"god": "2011"},
        "96": {"god": "2013"},
        "98": {"god": "2011"},
        "99": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Среднемесячная заработная плата работников организаций 
    # муниципальной формы собственности
    # !!! AUGMENTATION ONLY !!!
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "augm_wages_muni": {
        "num": 900,
        "id": "p8123017",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "okved": ("Раздел L Государственное управление и обеспечение  "
                      "военной безопасности;  социальное страхование"),
            "god": "2010",
            "period": "январь-декабрь"
            },
        "14": {"god": "2013"}
    },

    # = = = = = = = = = =
    # Коммунальная сфера
    # = = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Число проживающих в ветхих жилых домах
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "deter_housing": {
        "num": 11,
        "id": "p8008021",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "33": {"available": "no"},
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "84": {"god": "2007"},
        "92": {"god": "2008"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Количество негазифицированных населенных пунктов
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "ungasified": {
        "num": 12,
        "id": "p8008018",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"god": "2019"},
        "83": {"god": "2013"},
        "95": {"god": "2015"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Общая площадь жилых помещений
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "total_housing": {
        "num": 13,
        "id": "p8008019",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            },
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"god": "2019"},
        "96": {"god": "2012"}
    },

    # = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =
    # Социальная поддержка населения по оплате жилых помещений и
    # коммунальных услуг
    # = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Число семей, получавших субсидии на оплату жилого помещения и
    # коммунальных услуг на конец отчетного периода
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "subsidies": {
        "num": 14,
        "id": "p8012005",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "period": ["значение показателя за год", "значение за год",
                       "январь-декабрь", "Значение показателя за год"],
            "god": ["2008", "2014"]
        },
        "08": {"god": "2015"},
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"available": "no"}
    },

    # = = = = = = = = =
    # Здравоохранение
    # = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Численность врачей всех специальностей (без зубных)
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "doctors": {
        "num": 15,
        "id": "p8018106",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            "zdrav": "*"
            },
        "30": {"available": "no"},
        "33": {"available": "no"},
        "35": {"available": "no"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Численность среднего медицинского персонала
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "nurses": {
        "num": 16,
        "id": "p8018107",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            "zdrav": "*"
            },
        "30": {"available": "no"},
        "33": {"available": "no"},
        "35": {"available": "no"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "84": {"god": "2008"},
        "96": {"god": "2012"}
    },

    # = = = = = = = = = = = = = = = = = =
    # Социальное обслуживание населения
    # = = = = = = = = = = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Численность лиц, обслуженных отделениями социального обслуживания
    # на дому граждан пожилого возраста и инвалидов
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "elderly": {
        "num": 17,
        "id": "p8019008",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "10": {"god": "2011"},
        "33": {"available": "no"},
        "35": {"available": "no"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "96": {"god": "2012"}
    },

    # = = = = = = =
    # Образование
    # = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Число организаций, осуществляющих образовательную деятельность по
    # образовательным программам дошкольного образования, присмотр и
    # уход за детьми
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "kindergarten": {
        "num": 18,
        "id": "p8014001",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            "tipushr": ["Всего", "Дошкольные образовательные организации",
                        "Дошкольные образовательные учреждения"]
            },
        "01": {"god": "2008"},
        "03": {"god": "2006"},
        "08": {"god": "2006"},
        "11": {"god": "2006"},
        "12": {"god": "2006"},
        "15": {"god": "2007"},
        "22": {"god": "2007"},
        "24": {"god": "2006"},
        "28": {"god": "2007"},
        "33": {"god": "2007"},
        "34": {"god": "2008"},
        "35": {"god": "2014"},
        "36": {"god": "2006"},
        "38": {"god": "2007"},
        "52": {"god": "2007"},
        "53": {"god": "2006"},
        "56": {"god": "2008"},
        "57": {"god": "2008"},
        "60": {"god": "2007"},
        "66": {"god": "2007"},
        "67": {"available": "no"},
        "70": {"god": "2016"},
        "71": {"god": "2008"},
        "77": {"god": "2006"},
        "80": {"god": "2007"},
        "82": {"god": "2017"},
        "86": {"god": "2008"},
        "91": {"god": "2008"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Число общеобразовательных организаций на начало учебного года
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "schools": {
        "num": 19,
        "id": "p8015001",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "33": {"available": "no"},
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Численность обучающихся в общеобразовательных организациях с
    # учетом обособленных подразделений
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "schoolchildren": {
        "num": 20,
        "id": "p8015002",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "33": {"available": "no"},
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"available": "no"},
        "96": {"god": "2012"}
    },

    # = = = = = = = = = = =
    # Строительство жилья
    # = = = = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Введено в действие жилых домов на территории муниципального
    # образования
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "total_new_housing": {
        "num": 21,
        "id": "p8010001",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "35": {"god": "2015"},
        "40": {"god": "2013"},
        "67": {"available": "no"},
        "96": {"god": "2012"}
    },

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Введено в действие индивидуальных жилых домов на территории
    # муниципального образования
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "indiv_new_housing": {
        "num": 22,
        "id": "p8010002",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"]
            },
        "35": {"god": "2015"},
        "40": {"god": "2013"},
        "67": {"available": "no"},
        "77": {"available": "no"},
        "96": {"god": "2012"}
    },

    # = = = = = = = =
    # Местный бюджет
    # = = = = = = = =

    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
    # Доходы местного бюджета, фактически исполненные
    # - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

    "ndfl": {
        "num": 23,
        "id": "p8013001",
        "default": {
            "available": "yes",
            "munr": "*",
            "tippos": "*",
            "oktmo": "*",
            "god": "2010",
            "period": ["значение показателя за год", "значение за год",
                       "Значение показателя за год"],
            "stdohod": "Налог на доходы физических лиц"
            },
        "35": {"god": "2015"},
        "40": {"available": "no"},
        "67": {"god": "2017"},
        "77": {"god": "2011"},
        "89": {"god": "2009"},
        "91": {"god": "2009"},
        "96": {"god": "2012"}
    }
}


def _calc_template(indicator_name: str, region_code: str) -> dict:
    """
    Calculate a template for a specified region, specified indicator,
    based on default template, per-indicator customizations and local
    (region-level) customizations.
    """
    if indicator_name not in templates:
        raise ValueError('Unknown indicator')
    if region_code not in region_codes:
        raise ValueError('Unknown region code')
    base_template = templates.get(indicator_name, {}).get('default', {})
    over_template = templates.get(indicator_name, {}).get(region_code, {})
    return {**base_template, **over_template}
